# This case study consists of 1000 marks and the solution file is expected to be submitted in the upcoming session for evaluation.

### Step 1. Import the necessary libraries

In [147]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset chipotle.tsv.

Read using pd.read_csv

In [148]:
import os
os.getcwd()

'C:\\Users\\Nirmal\\Downloads'

In [162]:
path = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv" #Provide path here
chipo = pd.read_csv(path, sep = '\t') #Read file using pandas

### Step 3. See the first 10 entries

In [150]:
chipo.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

### Step 4. What is the number of observations in the dataset?

In [151]:
chipo['order_id'].count()

4622

### Step 5. What is the number of columns in the dataset?

In [152]:
chipo.shape

(4622, 5)

### Step 6. Print the name of all the columns.

In [153]:
for col in chipo.columns:
    print (col)

order_id
quantity
item_name
choice_description
item_price

### Step 7. How is the dataset indexed?

In [154]:
chipo.index.names=["id"]
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
id,,,,,
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

### Step 8. Which was the most-ordered item? 

(Replace *** with proper answer)

In [155]:
out=chipo.groupby('item_name').count()
output=np.where(out['quantity'] == max(out['quantity']))
out.iloc[output]

              order_id  quantity  choice_description  item_price
item_name
Chicken Bowl       726       726                 726         726

### Step 9. What was the most ordered item in the choice_description column?

In [156]:
choice=chipo.groupby('choice_description').count()
choice1=np.where(choice['quantity'] == max(choice['quantity']))
choice.iloc[choice1]

                    order_id  quantity  item_name  item_price
choice_description
[Diet Coke]              134       134        134         134

### Step 10. How many items were ordered in total?

In [122]:
chipo['item_name'].count()

4622

### Step 11. Turn the item price into a float

#### Step 11.a. Check the item price type

In [163]:
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [164]:
chipo['item_price'].dtype

dtype('O')

#### Step 11.b. Change the type of item price

In [165]:
chipo['item_price']=chipo['item_price'].apply(lambda x: x.split('$')[1])
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [166]:
chipo['item_price']=pd.to_numeric(chipo['item_price'])
chipo['item_price'].dtype

dtype('float64')

### Step 12. How much was the revenue for the period in the dataset?

In [167]:
chipo['Revenue']=chipo['quantity'] * chipo['item_price']
sum=chipo['Revenue'].sum()
print(('Revenue was: $' + str(sum)))

Revenue was: $39237.02

### Step 13. How many orders were made in the period?

In [168]:
orders = chipo.order_id.value_counts().count()
orders

1834

### Step 14 What is the average revenue amount per order?

In [169]:
chipo['Revenue'].mean()

8.48918649935093

### Step 15. How many different items are sold?

In [170]:
chipo.item_name.value_counts().count()

50

### Step 16. How many products cost more than $10.00? Please follow the comment.

Replace  **  with proper ans

In [171]:
items=np.where(chipo['Revenue'] > 10.00)
items_out=chipo.iloc[items]
items_out['item_name'].value_counts().count()

39

### Step 17. What is price of each item with most to least expensive? 
###### Select a data frame with only two columns item_name and item_price

In [172]:
price_per_item = chipo.loc[:,['item_name','item_price']]
price_per_item.head()

                               item_name  item_price
0           Chips and Fresh Tomato Salsa        2.39
1                                   Izze        3.39
2                       Nantucket Nectar        3.39
3  Chips and Tomatillo-Green Chili Salsa        2.39
4                           Chicken Bowl       16.98

In [175]:
output_sort=price_per_item.sort_values(by=['item_name','item_price'],ascending=False)
output_sort.head()

              item_name  item_price
3889  Veggie Soft Tacos       16.98
738   Veggie Soft Tacos       11.25
1699  Veggie Soft Tacos       11.25
781   Veggie Soft Tacos        8.75
2384  Veggie Soft Tacos        8.75

### Step 18. Sort by the name of the item

In [176]:
train_sort=chipo.sort_values(by='item_name',ascending=True)
train_sort.head()

,order_id,quantity,item_name,choice_description,item_price,Revenue
3389,1360,2,6 Pack Soft Drink,[Diet Coke],12.98,25.96
341,148,1,6 Pack Soft Drink,[Diet Coke],6.49,6.49
1849,749,1,6 Pack Soft Drink,[Coke],6.49,6.49
1860,754,1,6 Pack Soft Drink,[Diet Coke],6.49,6.49
2713,1076,1,6 Pack Soft Drink,[Coke],6.49,6.49

### Step 19. How many times were a Veggie Salad Bowl ordered?

In [178]:
chipo_salad = chipo[chipo.item_name == "Veggie Salad Bowl"]

len(chipo_salad)

18

### Step 20. How many times people orderd more than one Canned Soda?

In [26]:
chipo_drink_steak_bowl = chipo[(chipo.item_name == "Canned Soda") & (chipo.quantity > 1)]
len(chipo_drink_steak_bowl)

20